# Jupyter Notebook Excercises
Im Folgenden werden alle Aufgaben rund um das Jupyter Notebook ausgeführt.

## Aufgabe 1
Load the countries.csv directly via URL import into your panda data frame!

In [66]:
#Imports
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np

#Imports the data via URL
url = "https://raw.githubusercontent.com/edlich/eternalrepo/master/DS-WAHLFACH/countries.csv"
data = pd.read_csv(url)

data

       Name     People     Area   BIP Currency
0   Germany   82521653   357385  3466      EUR
1     Japan  126045000   377835  4938      YEN
2    Canada   36503097  9984670  1529      CAD
3     Italy   60501718   301338  1850      EUR
4  Brazilia  208360000  8515770  1798     REAL

## Aufgabe 2
Display some basic information as rows, columns and some basic statistical info.

#### Die Spalten des Datensatzes

In [8]:
data.columns

Index(['Name', 'People', 'Area', 'BIP', 'Currency'], dtype='object')

#### Die Reihen des Datensatzes

In [9]:
data.index

RangeIndex(start=0, stop=5, step=1)

#### Basisstatistiken

In [7]:
data.describe()

             People          Area         BIP
count  5.000000e+00  5.000000e+00     5.00000
mean   1.027863e+08  3.907400e+06  2716.20000
std    6.759970e+07  4.904957e+06  1457.86083
min    3.650310e+07  3.013380e+05  1529.00000
25%    6.050172e+07  3.573850e+05  1798.00000
50%    8.252165e+07  3.778350e+05  1850.00000
75%    1.260450e+08  8.515770e+06  3466.00000
max    2.083600e+08  9.984670e+06  4938.00000

#### Größe des Datensatzes

In [5]:
data.shape

(5, 5)

#### Anzahl an Elementen im Datensatz

In [6]:
data.size

25

## Aufgabe 3
Show the last 4 rows of the data frame.

In [10]:
data.tail(4)

       Name     People     Area   BIP Currency
1     Japan  126045000   377835  4938      YEN
2    Canada   36503097  9984670  1529      CAD
3     Italy   60501718   301338  1850      EUR
4  Brazilia  208360000  8515770  1798     REAL

## Aufgabe 4
Show all the row of countries who have the EURO.

In [17]:
data.loc[data['Currency'] == "EUR"]

      Name    People    Area   BIP Currency
0  Germany  82521653  357385  3466      EUR
3    Italy  60501718  301338  1850      EUR

## Aufgabe 5
Show only name and Currency in a new data frame.

In [24]:
data[['Name', 'Currency']]

       Name Currency
0   Germany      EUR
1     Japan      YEN
2    Canada      CAD
3     Italy      EUR
4  Brazilia     REAL

## Aufgabe 6
Show only the rows/countries that have more than 2000 BIP (it is in Milliarden USD Bruttoinlandsprodukt).

In [29]:
data[data['BIP'] > 2000]

      Name     People    Area   BIP Currency
0  Germany   82521653  357385  3466      EUR
1    Japan  126045000  377835  4938      YEN

## Aufgabe 7
Select all countries where with inhabitants between 50 and 150 Mio.

In [32]:
data[data['People'].between(50000000, 150000000)]

      Name     People    Area   BIP Currency
0  Germany   82521653  357385  3466      EUR
1    Japan  126045000  377835  4938      YEN
3    Italy   60501718  301338  1850      EUR

## Aufgabe 8
Change BIP to Bip.

In [37]:
data = data.rename(columns={'BIP': 'Bip'})
data

       Name     People     Area   Bip Currency
0   Germany   82521653   357385  3466      EUR
1     Japan  126045000   377835  4938      YEN
2    Canada   36503097  9984670  1529      CAD
3     Italy   60501718   301338  1850      EUR
4  Brazilia  208360000  8515770  1798     REAL

## Aufgabe 9
Calculate the Bip sum.

In [39]:
data['Bip'].sum()

13581

## Aufgabe 10
Calculate the average people of all countries.

In [40]:
data['People'].mean()

102786293.6

## Aufgabe 11
Sort by name alphabetically.

In [43]:
data.sort_values(by='Name')

       Name     People     Area   Bip Currency
4  Brazilia  208360000  8515770  1798     REAL
2    Canada   36503097  9984670  1529      CAD
0   Germany   82521653   357385  3466      EUR
3     Italy   60501718   301338  1850      EUR
1     Japan  126045000   377835  4938      YEN

## Aufgabe 12
Create a new data frame from the original where the area is changed as follows: all countries with > 1000000 get BIG and <= 1000000 get SMALL in the cell replaced!

In [65]:
new_data = data

conditions = [
    new_data['Area'] > 1000000,
    new_data['Area'] <= 1000000
]

choices = ['BIG', 'SMALL']

new_data['Area'] = np.select(conditions, choices, default=0)

new_data

       Name     People   Area   BIP Currency
0   Germany   82521653  SMALL  3466      EUR
1     Japan  126045000  SMALL  4938      YEN
2    Canada   36503097    BIG  1529      CAD
3     Italy   60501718  SMALL  1850      EUR
4  Brazilia  208360000    BIG  1798     REAL